# -*- coding: utf-8 -*-
"""

This is a script file to illustrating modules.
"""

#%%
#
def fibonacci(n):
    """display the Fibonacci sequence using recursion"""
    if n <= 1:
        return n
    else:
        return(fibonacci(n-1) + fibonacci(n-2))

a_dream_of_red_mansions = {
 '凤姐': {
			'李纨': 236,'黛玉': 297,'宝玉': 1844,'迎春': 171,
  			'宝钗': 358,'湘云': 164,'探春': 445,'惜春': 242
  			},
 '探春': {
 			'迎春': 180,'惜春': 163,'黛玉': 613,'宝玉': 1186,
 			'宝钗': 372,'李纨': 371,'湘云': 345,'凤姐': 445
 			},
 '宝钗': {
 			'黛玉': 899,'迎春': 161,'宝玉': 2812,'探春': 372,
 			'惜春': 121,'凤姐': 358,'李纨': 243,'湘云': 483,
  			'妙玉': 120},
 '湘云': {
 			'黛玉': 531, '宝玉': 868, '宝钗': 483, '李纨': 144, 
 			'凤姐': 164, '探春': 345
 			},
 '宝玉': {
 			'黛玉': 3616,'探春': 1186,'迎春': 298,'惜春': 408,
  			'宝钗': 2812,'秦氏': 130,'李纨': 620,'凤姐': 1844,
  			'湘云': 868,'妙玉': 527
  			},
 '李纨': {
 			'黛玉': 360,'宝玉': 620,'探春': 371,'凤姐': 236,
  			'宝钗': 243,'湘云': 144,'惜春': 139
  			},
 '黛玉': {
 			'宝玉': 3616,'迎春': 120,'探春': 613,'惜春': 138,
  			'李纨': 360,'宝钗': 899,'凤姐': 297,'湘云': 531,
  			'妙玉': 115
  			},
 '妙玉': {
 			'宝玉': 527, '宝钗': 120, '黛玉': 115, '惜春': 289
 			},
 '秦氏': {
 			'宝玉': 130
 			},
 '迎春': {
 			'探春': 180, '黛玉': 120, '宝玉': 298, '宝钗': 161, 
 			'凤姐': 171
 			},
 '惜春': {
 			'探春': 163,'黛玉': 138,'宝玉': 408,'宝钗': 121,
  			'李纨': 139,'凤姐': 242,'妙玉': 289
  			}
}
#%%
# By charley: 这里表示主函数！
if __name__ == "__main__":
    nterms = 10
    for i in range(nterms):
        print(fibonacci(i))